olliw42/stm32ll-lib/src/stdstm32-uart.h
//*******************************************************
// Copyright (c) OlliW, OlliW42, www.olliw.eu
// GPL3
// https://www.gnu.org/licenses/gpl-3.0.de.html
//*******************************************************
// my stripped down UART standard library
// only ISR, no DMA, no wait and tmo rx functions, no convenience functions
//*******************************************************
// Interface:
//
// #define UART_USE_UART1, UART_USE_UART1_PA9PA10, UART_USE_UART1_PB6PB7, UART_USE_UART1_PC4PC5
// #define UART_USE_UART2, UART_USE_UART2_PA2PA3, UART_USE_UART2_PD5PD6, UART_USE_UART2_PB3PB4, UART_USE_UART2_PA14PA15
// #define UART_USE_UART3, UART_USE_UART3_PB10PB11, UART_USE_UART3_PC10PC11, UART_USE_UART3_PB8PB9
// #define UART_USE_UART4, UART_USE_UART4_PC10PC11, UART_USE_UART4_PA0PA1
// #define UART_USE_UART5, UART_USE_UART5_PC12PD2
// #define UART_USE_UART6, UART_USE_UART6_PG14PG9
// #define UART_USE_UART7, UART_USE_UART7_PE8PE7, UART_USE_UART7_PF7PF6
// #define UART_USE_UART8, UART_USE_UART8_PE1PE0
// #define UART_USE_LPUART1, UART_USE_LPUART1_PA2PA3, UART_USE_LPUART1_PC1PC0
//
// #define UART_BAUD
//
// #define UART_USE_TX
// #define UART_TXBUFSIZE
// #define UART_USE_TX_ISR
// #define UART_USE_TX_DMA
// #define UART_INVERTED
//
// #define UART_USE_RX
// #define UART_RXBUFSIZE
//
// #define UART_IRQ_PRIORITY
//
// #define UART_USE_RXERRORCOUNT
//
// #define UART_RX_CALLBACK_FULL(c)
// #define UART_TC_CALLBACK() // ATTENTION: when used, one never should trigger TC isr without a byte written to the tx buffer
//
//*******************************************************
#ifndef STDSTM32_UART_H
#define STDSTM32_UART_H
#ifdef __cplusplus
extern "C" {
#endif


//-------------------------------------------------------
// Enums
//-------------------------------------------------------
// in order to not introduce hardware dependency upstream
// we define our own enums for parity and stopbits

#ifndef UART_ENUMS
#define UART_ENUMS

typedef enum {
  XUART_PARITY_NO = LL_USART_PARITY_NONE, // XUART_xxx to avoid overlap with HAL
  XUART_PARITY_EVEN = LL_USART_PARITY_EVEN,
  XUART_PARITY_ODD = LL_USART_PARITY_ODD,
  XUART_PARITY_MAKEITU32 = UINT32_MAX,
} UARTPARITYENUM;

typedef enum {
#ifdef LL_USART_STOPBITS_0_5
  UART_STOPBIT_0_5 = LL_USART_STOPBITS_0_5, // not allowed for LPUART, and some STM32F0!
#endif
  UART_STOPBIT_1 = LL_USART_STOPBITS_1,
#ifdef LL_USART_STOPBITS_1_5
  UART_STOPBIT_1_5 = LL_USART_STOPBITS_1_5, // not allowed for LPUART, and some STM32!
#endif
  UART_STOPBIT_2 = LL_USART_STOPBITS_2,
  UART_STOPBIT_MAKEITU32 = UINT32_MAX,
} UARTSTOPBITENUM;

#endif


//-------------------------------------------------------
// Defines
//-------------------------------------------------------

#include "stdstm32-peripherals.h"

#if (defined UART_USE_TX_ISR) && (!defined UART_USE_TX)
  #error UART_USE_TX_ISR used without UART_USE_TX!
#endif
#if (defined UART_USE_RXERRORCOUNT) && (!defined UART_USE_RX)
  #error UART_USE_RXERRORCOUNT used without UART_USE_RX!
#endif

#ifdef UART_USE_TX_DMA
  #error UART_USE_TX_DMA not supported by this library!
#endif


#ifndef UART_BAUD
  #define UART_BAUD             115200UL // 9600UL
#endif


#ifdef UART_USE_TX_ISR
  #ifndef UART_TXBUFSIZE
    #define UART_TXBUFSIZE      256 // MUST be 2^N
  #endif
  #if UART_TXBUFSIZE < 2
    #error UART_TXBUFSIZE must be larger than 1 !
  #elif ((UART_TXBUFSIZE & (UART_TXBUFSIZE-1)) != 0)
    #error UART_TXBUFSIZE must be a power of 2 !
  #endif

  #define UART_TXBUFSIZEMASK  (UART_TXBUFSIZE-1)

  volatile char uart_txbuf[UART_TXBUFSIZE];
  volatile uint16_t uart_txwritepos; // pos at which the last byte was stored
  volatile uint16_t uart_txreadpos; // pos at which the next byte is to be fetched
#endif


#ifdef UART_USE_RX
  #ifndef UART_RXBUFSIZE
    #define UART_RXBUFSIZE      256 //128 //MUST be 2^N
  #endif
  #if UART_RXBUFSIZE < 2
    #error UART_RXBUFSIZE must be larger than 1 !
  #elif ((UART_RXBUFSIZE & (UART_RXBUFSIZE-1)) != 0)
    #error UART_RXBUFSIZE must be a power of 2 !
  #endif

  #define UART_RXBUFSIZEMASK  (UART_RXBUFSIZE-1)

  volatile char uart_rxbuf[UART_RXBUFSIZE];
  volatile uint16_t uart_rxwritepos; // pos at which the last byte was stored
  volatile uint16_t uart_rxreadpos; // pos at which the next byte is to be fetched

  #ifdef UART_USE_RXERRORCOUNT
  volatile uint32_t uart_errorcnt_rxnoise;
  volatile uint32_t uart_errorcnt_rxframe;
  volatile uint32_t uart_errorcnt_rxoverrun;
  #endif
#endif


// catch legacy defines
#if defined UART_USE_UART1_REMAPPED || defined UART_USE_UART1_REMAPPED2
  #error REMAPPED not supported anymore!
#endif
#if defined UART_USE_UART2_REMAPPED || defined UART_USE_UART2_REMAPPED2 || defined UART_USE_UART2_REMAPPED3
  #error REMAPPED not supported anymore!
#endif
#if defined UART_USE_UART3_REMAPPED
  #error REMAPPED not supported anymore!
#endif
#if defined UART_USE_UART4_REMAPPED
  #error REMAPPED not supported anymore!
#endif
#if defined UART_USE_UART6_REMAPPED
  #error REMAPPED not supported anymore!
#endif
#if defined UART_USE_UART7_REMAPPED
  #error REMAPPED not supported anymore!
#endif
#if defined UART_USE_LPUART1_REMAPPED
  #error REMAPPED not supported anymore!
#endif


#if defined UART_USE_UART1 || defined UART_USE_UART1_PA9PA10 || defined UART_USE_UART1_PB6PB7 || defined UART_USE_UART1_PC4PC5
  #define UART_UARTx             USART1
  #ifdef UART_USE_UART1
    // user needs to specify UART_USE_TX_IO, UART_USE_RX_IO, and possibly UART_USE_IO_AF
  #elif defined UART_USE_UART1_PA9PA10
    #define UART_TX_IO           IO_PA9
    #define UART_RX_IO           IO_PA10
  #elif defined UART_USE_UART1_PB6PB7 // was UART1_REMAPPED
    #define UART_TX_IO           IO_PB6
    #define UART_RX_IO           IO_PB7
  #elif defined UART_USE_UART1_PC4PC5 // only G4 // was UART1_REMAPPED2
    #define UART_TX_IO           IO_PC4
    #define UART_RX_IO           IO_PC5
  #endif
  #ifndef STM32F0
    #define UART_IO_AF           IO_AF_7
  #else
    #ifdef UART_USE_UART1
      // user needs to specify UART_USE_IO_AF
    #elif defined UART_USE_UART1_PA9PA10
      #define UART_IO_AF         IO_AF_1
    #elif defined UART_USE_UART1_PB6PB7
      #define UART_IO_AF         IO_AF_0
    #else
      #error UART_USE_UART1 mapping not available on STM32F0 !
    #endif
  #endif
  #define UART_IRQn              USART1_IRQn
  #define UART_IRQHandler        USART1_IRQHandler
  #if defined STM32F1
  #elif defined STM32F3
  #elif defined STM32F7
  #elif defined STM32G4
  #elif defined STM32L4
  #elif defined STM32WL
  #endif

