olliw42/stm32ll-lib/src/stdstm32-uart.h
#elif defined UART_USE_UART2 || defined UART_USE_UART2_PA2PA3 || defined UART_USE_UART2_PD5PD6 || defined UART_USE_UART2_PB3PB4 || defined UART_USE_UART2_PA14PA15
  #define UART_UARTx             USART2
  #ifdef UART_USE_UART2
    // user needs to specify UART_USE_TX_IO, UART_USE_RX_IO, and possibly UART_USE_IO_AF
  #elif defined UART_USE_UART2_PA2PA3
    #define UART_TX_IO           IO_PA2
    #define UART_RX_IO           IO_PA3
  #elif defined UART_USE_UART2_PD5PD6 // was UART2_REMAPPED
    #define UART_TX_IO           IO_PD5
    #define UART_RX_IO           IO_PD6
  #elif defined UART_USE_UART2_PB3PB4 // only G4 // was UART2_REMAPPED2
    #define UART_TX_IO           IO_PB3
    #define UART_RX_IO           IO_PB4
  #elif defined UART_USE_UART2_PA14PA15 // only G4, F0 // ATTENTION: on G4 PA14 overlaps with SWCLK // was UART2_REMAPPED3
    #define UART_TX_IO           IO_PA14
    #define UART_RX_IO           IO_PA15
  #endif
  #ifndef STM32F0
    #define UART_IO_AF           IO_AF_7
  #else
    #if defined UART_USE_UART2
      // user needs to specify UART_USE_IO_AF
    #elif defined UART_USE_UART2_PA2PA3 || defined UART_USE_UART2_PA14PA15
      #define UART_IO_AF         IO_AF_1
    #else
      #error UART_USE_UART2 mapping not available on STM32F0 !
    #endif
  #endif
  #define UART_IRQn              USART2_IRQn
  #define UART_IRQHandler        USART2_IRQHandler
  #if defined STM32F1
  #elif defined STM32F3
  #elif defined STM32F7
  #elif defined STM32G4
  #elif defined STM32L4
  #elif defined STM32WL
  #endif

#elif defined UART_USE_UART3 || defined UART_USE_UART3_PB10PB11 || defined UART_USE_UART3_PC10PC11 || defined UART_USE_UART3_PB8PB9
  #define UART_UARTx             USART3
  #if defined UART_USE_UART3
    // user needs to specify UART_USE_TX_IO, UART_USE_RX_IO, and possibly UART_USE_IO_AF
  #elif defined UART_USE_UART3_PB10PB11
    #define UART_TX_IO           IO_PB10
    #define UART_RX_IO           IO_PB11
  #elif defined UART_USE_UART3_PC10PC11 // was UART3_REMAPPED
    #define UART_TX_IO           IO_PC10
    #define UART_RX_IO           IO_PC11
  #elif defined UART_USE_UART3_PB8PB9 // only F3
    #define UART_TX_IO           IO_PB8
    #define UART_RX_IO           IO_PB9
  #else
  #endif
  #ifndef STM32F0
    #define UART_IO_AF           IO_AF_7
  #else
    #if defined UART_USE_UART3
      // user needs to specify UART_USE_IO_AF
    #elif defined defined UART_USE_UART3_PB10PB11 || defined UART_USE_UART3_PB8PB9
      #define UART_IO_AF         IO_AF_4
    #elif defined UART_USE_UART3_PC10PC11
      #define UART_IO_AF         IO_AF_1
    #else
      #error UART_USE_UART3 mapping not available on STM32F0 !
    #endif
  #endif
  #define UART_IRQn              USART3_IRQn
  #define UART_IRQHandler        USART3_IRQHandler
  #if defined STM32F1
  #elif defined STM32F3
  #elif defined STM32F7
  #elif defined STM32G4
  #elif defined STM32L4
  #elif defined STM32WL
    #error UART3 NOT AVAILABLE !
  #elif defined STM32F0
    #undef UART_IRQn
    #undef UART_IRQHandler
    #define UART_IRQn            USART3_4_IRQn
    #define UART_IRQHandler      USART3_4_IRQHandler
  #endif

#elif defined UART_USE_UART4 || defined UART_USE_UART4_PC10PC11 || defined UART_USE_UART4_PA0PA1
  #define UART_UARTx             UART4
  #ifdef UART_USE_UART4
    // user needs to specify UART_USE_TX_IO, UART_USE_RX_IO, and possibly UART_USE_IO_AF
  #elif defined UART_USE_UART4_PC10PC11
    #define UART_TX_IO           IO_PC10
    #define UART_RX_IO           IO_PC11
  #elif defined UART_USE_UART4_PA0PA1 // only F7 // was UART4_REMAPPED
    #define UART_TX_IO           IO_PA0
    #define UART_RX_IO           IO_PA1
  #endif
  #if defined STM32F1
    #define UART_IO_AF           IO_AF_DEFAULT
  #elif defined STM32F7
    #define UART_IO_AF           IO_AF_8
  #elif defined STM32G4
    #define UART_IO_AF           IO_AF_5
  #endif
  #define UART_IRQn              UART4_IRQn
  #define UART_IRQHandler        UART4_IRQHandler
  #if defined STM32F1
  #elif defined STM32F3
    #warning UART IO_AF & DMA for F3 still TODO
  #elif defined STM32F7
  #elif defined STM32G4
  #elif defined STM32L4
    #error TODO ?!?
  #elif defined STM32WL
    #error UART4 NOT AVAILABLE !
  #elif defined STM32F0
    #undef UART_IRQn
    #undef UART_IRQHandler
    #define UART_IRQn            USART3_4_IRQn
    #define UART_IRQHandler      USART3_4_IRQHandler
  #endif

#elif defined UART_USE_UART5 || defined UART_USE_UART5_PC12PD2
  #define UART_UARTx             UART5
  #ifdef UART_USE_UART5
    // user needs to specify UART_USE_TX_IO, UART_USE_RX_IO, and possibly UART_USE_IO_AF
  #elif defined UART_USE_UART5_PC12PD2
    #define UART_TX_IO           IO_PC12
    #define UART_RX_IO           IO_PD2
  #endif
  #define UART_IRQn              UART5_IRQn
  #define UART_IRQHandler        UART5_IRQHandler
  #if defined STM32F1
    #define UART_IO_AF           IO_AF_DEFAULT
  #elif defined STM32F3
    #warning UART IO_AF & DMA for F3 still TODO //TODO
  #elif defined STM32F7
    #define UART_IO_AF           IO_AF_8
  #elif defined STM32G4
    #define UART_IO_AF           IO_AF_5
  #elif defined STM32L4
    #error TODO ?!?
  #elif defined STM32WL
    #error UART5 NOT AVAILABLE !
  #endif

#elif defined UART_USE_UART6 || defined UART_USE_UART6_PG14PG9
  #define UART_UARTx             USART6
  #ifdef UART_USE_UART6
    // user needs to specify UART_USE_TX_IO, UART_USE_RX_IO, and possibly UART_USE_IO_AF
  #elif defined UART_USE_UART6_PC6PC7
    #define UART_TX_IO           IO_PC6
    #define UART_RX_IO           IO_PC7
  #elif defined UART_USE_UART6_PG14PG9 // was UART6_REMAPPED
    #define UART_TX_IO           IO_PG14
    #define UART_RX_IO           IO_PG9
  #endif
  #define UART_IO_AF             IO_AF_8
  #define UART_IRQn              USART6_IRQn
  #define UART_IRQHandler        USART6_IRQHandler

  #if defined STM32F1 || defined STM32F3 || defined STM32G4 || defined STM32WL
    #error UART6 NOT AVAILABLE !
  #elif defined STM32F7
  #elif defined STM32L4
    #error TODO ?!?
  #endif

#elif defined UART_USE_UART7 || defined UART_USE_UART7_PE8PE7 || defined UART_USE_UART7_PF7PF6
  #define UART_UARTx             UART7
  #ifdef UART_USE_UART7
    // user needs to specify UART_USE_TX_IO, UART_USE_RX_IO, and possibly UART_USE_IO_AF
  #elif defined UART_USE_UART7_PE8PE7
    #define UART_TX_IO           IO_PE8
    #define UART_RX_IO           IO_PE7
  #elif defined UART_USE_UART7_PF7PF6 // was UART7_REMAPPED
    #define UART_TX_IO           IO_PF7
    #define UART_RX_IO           IO_PF6
  #endif
  #define UART_IO_AF             IO_AF_8
  #define UART_IRQn              UART7_IRQn
  #define UART_IRQHandler        UART7_IRQHandler

